sysbench_test_OpenGauss_Mixed.log
========================================
Sysbench Test Parameters:
TABLES=20, TABLE_SIZE=500000, THREADS=32, TIME=600, REPORT_INTERVAL=10
========================================
[1/3] Preparing data...
sysbench /usr/share/sysbench/oltp_read_write.lua --db-driver=pgsql --pgsql-host=172.17.0.2 --pgsql-port=5432 --pgsql-user=sbtest --pgsql-password=Opengauss@2022 --pgsql-db=sbtest --tables=20 --table-size=500000 prepare
sysbench 1.0.11 (using system LuaJIT 2.1.0-beta3)

Creating table 'sbtest1'...
Inserting 500000 records into 'sbtest1'
Creating a secondary index on 'sbtest1'...
Creating table 'sbtest2'...
Inserting 500000 records into 'sbtest2'
Creating a secondary index on 'sbtest2'...
Creating table 'sbtest3'...
Inserting 500000 records into 'sbtest3'
Creating a secondary index on 'sbtest3'...
Creating table 'sbtest4'...
Inserting 500000 records into 'sbtest4'
Creating a secondary index on 'sbtest4'...
Creating table 'sbtest5'...
Inserting 500000 records into 'sbtest5'
Creating a secondary index on 'sbtest5'...
Creating table 'sbtest6'...
Inserting 500000 records into 'sbtest6'
Creating a secondary index on 'sbtest6'...
Creating table 'sbtest7'...
Inserting 500000 records into 'sbtest7'
Creating a secondary index on 'sbtest7'...
Creating table 'sbtest8'...
Inserting 500000 records into 'sbtest8'
Creating a secondary index on 'sbtest8'...
Creating table 'sbtest9'...
Inserting 500000 records into 'sbtest9'
Creating a secondary index on 'sbtest9'...
Creating table 'sbtest10'...
Inserting 500000 records into 'sbtest10'
Creating a secondary index on 'sbtest10'...
Creating table 'sbtest11'...
Inserting 500000 records into 'sbtest11'
Creating a secondary index on 'sbtest11'...
Creating table 'sbtest12'...
Inserting 500000 records into 'sbtest12'
Creating a secondary index on 'sbtest12'...
Creating table 'sbtest13'...
Inserting 500000 records into 'sbtest13'
Creating a secondary index on 'sbtest13'...
Creating table 'sbtest14'...
Inserting 500000 records into 'sbtest14'
Creating a secondary index on 'sbtest14'...
Creating table 'sbtest15'...
Inserting 500000 records into 'sbtest15'
Creating a secondary index on 'sbtest15'...
Creating table 'sbtest16'...
Inserting 500000 records into 'sbtest16'
Creating a secondary index on 'sbtest16'...
Creating table 'sbtest17'...
Inserting 500000 records into 'sbtest17'
Creating a secondary index on 'sbtest17'...
Creating table 'sbtest18'...
Inserting 500000 records into 'sbtest18'
Creating a secondary index on 'sbtest18'...
Creating table 'sbtest19'...
Inserting 500000 records into 'sbtest19'
Creating a secondary index on 'sbtest19'...
Creating table 'sbtest20'...
Inserting 500000 records into 'sbtest20'
Creating a secondary index on 'sbtest20'...
[2/3] Running benchmark...
sysbench /usr/share/sysbench/oltp_read_write.lua --db-driver=pgsql --pgsql-host=172.17.0.2 --pgsql-port=5432 --pgsql-user=sbtest --pgsql-password=Opengauss@2022 --pgsql-db=sbtest --tables=20 --table-size=500000 --threads=32 --time=600 --report-interval=10 run
sysbench 1.0.11 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 32
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 32 tps: 404.06 qps: 8119.07 (r/w/o: 5690.02/1617.53/811.52) lat (ms,95%): 104.84 err/s: 0.10 reconn/s: 0.00
[ 20s ] thds: 32 tps: 382.00 qps: 7648.29 (r/w/o: 5352.46/1531.82/764.01) lat (ms,95%): 106.75 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 32 tps: 349.10 qps: 6971.95 (r/w/o: 4881.43/1392.31/698.20) lat (ms,95%): 118.92 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 32 tps: 374.40 qps: 7495.82 (r/w/o: 5247.31/1499.70/748.80) lat (ms,95%): 108.68 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 32 tps: 350.60 qps: 7009.10 (r/w/o: 4906.70/1401.00/701.40) lat (ms,95%): 112.67 err/s: 0.10 reconn/s: 0.00
[ 60s ] thds: 32 tps: 348.69 qps: 6969.24 (r/w/o: 4876.89/1394.97/697.38) lat (ms,95%): 118.92 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 32 tps: 336.41 qps: 6731.01 (r/w/o: 4712.17/1346.02/672.81) lat (ms,95%): 121.08 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 32 tps: 323.80 qps: 6486.45 (r/w/o: 4541.64/1297.01/647.81) lat (ms,95%): 125.52 err/s: 0.10 reconn/s: 0.00
[ 90s ] thds: 32 tps: 311.30 qps: 6217.40 (r/w/o: 4352.00/1242.70/622.70) lat (ms,95%): 139.85 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 32 tps: 313.80 qps: 6276.81 (r/w/o: 4392.51/1256.70/627.60) lat (ms,95%): 130.13 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 32 tps: 306.50 qps: 6129.07 (r/w/o: 4291.68/1224.39/613.00) lat (ms,95%): 134.90 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 32 tps: 303.70 qps: 6076.20 (r/w/o: 4253.00/1215.70/607.50) lat (ms,95%): 139.85 err/s: 0.00 reconn/s: 0.00
[ 130s ] thds: 32 tps: 276.30 qps: 5528.53 (r/w/o: 3870.42/1105.51/552.60) lat (ms,95%): 150.29 err/s: 0.00 reconn/s: 0.00
[ 140s ] thds: 32 tps: 278.40 qps: 5562.80 (r/w/o: 3894.00/1112.00/556.80) lat (ms,95%): 150.29 err/s: 0.00 reconn/s: 0.00
[ 150s ] thds: 32 tps: 254.10 qps: 5084.80 (r/w/o: 3559.50/1017.10/508.20) lat (ms,95%): 170.48 err/s: 0.00 reconn/s: 0.00
[ 160s ] thds: 32 tps: 288.29 qps: 5767.12 (r/w/o: 4036.87/1153.66/576.58) lat (ms,95%): 155.80 err/s: 0.00 reconn/s: 0.00
[ 170s ] thds: 32 tps: 253.30 qps: 5069.32 (r/w/o: 3548.35/1014.38/506.59) lat (ms,95%): 164.45 err/s: 0.00 reconn/s: 0.00
[ 180s ] thds: 32 tps: 258.61 qps: 5169.40 (r/w/o: 3619.64/1032.54/517.22) lat (ms,95%): 161.51 err/s: 0.00 reconn/s: 0.00
[ 190s ] thds: 32 tps: 262.80 qps: 5252.42 (r/w/o: 3676.01/1050.80/525.60) lat (ms,95%): 164.45 err/s: 0.00 reconn/s: 0.00
[ 200s ] thds: 32 tps: 241.20 qps: 4822.31 (r/w/o: 3375.61/964.30/482.40) lat (ms,95%): 170.48 err/s: 0.00 reconn/s: 0.00
[ 210s ] thds: 32 tps: 235.40 qps: 4713.71 (r/w/o: 3299.41/943.50/470.80) lat (ms,95%): 179.94 err/s: 0.00 reconn/s: 0.00
[ 220s ] thds: 32 tps: 261.50 qps: 5226.70 (r/w/o: 3659.10/1044.60/523.00) lat (ms,95%): 170.48 err/s: 0.00 reconn/s: 0.00
[ 230s ] thds: 32 tps: 231.20 qps: 4625.79 (r/w/o: 3238.79/924.50/462.50) lat (ms,95%): 183.21 err/s: 0.00 reconn/s: 0.00
[ 240s ] thds: 32 tps: 224.50 qps: 4491.79 (r/w/o: 3143.40/899.20/449.20) lat (ms,95%): 189.93 err/s: 0.00 reconn/s: 0.00
[ 250s ] thds: 32 tps: 216.40 qps: 4324.80 (r/w/o: 3027.30/864.70/432.80) lat (ms,95%): 196.89 err/s: 0.00 reconn/s: 0.00
[ 260s ] thds: 32 tps: 229.30 qps: 4589.39 (r/w/o: 3213.49/917.10/458.80) lat (ms,95%): 196.89 err/s: 0.10 reconn/s: 0.00
[ 270s ] thds: 32 tps: 207.70 qps: 4156.12 (r/w/o: 2909.11/831.40/415.60) lat (ms,95%): 219.36 err/s: 0.10 reconn/s: 0.00
[ 280s ] thds: 32 tps: 189.40 qps: 3789.00 (r/w/o: 2653.10/757.10/378.80) lat (ms,95%): 235.74 err/s: 0.00 reconn/s: 0.00
[ 290s ] thds: 32 tps: 204.10 qps: 4082.29 (r/w/o: 2857.19/816.90/408.20) lat (ms,95%): 227.40 err/s: 0.00 reconn/s: 0.00
[ 300s ] thds: 32 tps: 188.40 qps: 3766.29 (r/w/o: 2635.89/753.60/376.80) lat (ms,95%): 227.40 err/s: 0.00 reconn/s: 0.00
[ 310s ] thds: 32 tps: 174.90 qps: 3497.22 (r/w/o: 2448.31/699.10/349.80) lat (ms,95%): 244.38 err/s: 0.00 reconn/s: 0.00
[ 320s ] thds: 32 tps: 202.00 qps: 4042.00 (r/w/o: 2829.20/808.80/404.00) lat (ms,95%): 223.34 err/s: 0.00 reconn/s: 0.00
[ 330s ] thds: 32 tps: 177.90 qps: 3557.10 (r/w/o: 2490.80/710.50/355.80) lat (ms,95%): 272.27 err/s: 0.00 reconn/s: 0.00
[ 340s ] thds: 32 tps: 196.20 qps: 3922.40 (r/w/o: 2745.00/785.00/392.40) lat (ms,95%): 223.34 err/s: 0.00 reconn/s: 0.00
[ 350s ] thds: 32 tps: 183.90 qps: 3677.40 (r/w/o: 2573.60/736.00/367.80) lat (ms,95%): 244.38 err/s: 0.00 reconn/s: 0.00
[ 360s ] thds: 32 tps: 173.60 qps: 3473.59 (r/w/o: 2432.20/694.30/347.10) lat (ms,95%): 248.83 err/s: 0.00 reconn/s: 0.00
[ 370s ] thds: 32 tps: 187.60 qps: 3752.50 (r/w/o: 2626.20/751.00/375.30) lat (ms,95%): 248.83 err/s: 0.00 reconn/s: 0.00
[ 380s ] thds: 32 tps: 159.70 qps: 3195.28 (r/w/o: 2237.99/637.90/319.40) lat (ms,95%): 277.21 err/s: 0.00 reconn/s: 0.00
[ 390s ] thds: 32 tps: 180.10 qps: 3603.81 (r/w/o: 2521.51/722.10/360.20) lat (ms,95%): 257.95 err/s: 0.00 reconn/s: 0.00
[ 400s ] thds: 32 tps: 165.70 qps: 3311.12 (r/w/o: 2318.11/661.60/331.40) lat (ms,95%): 257.95 err/s: 0.00 reconn/s: 0.00
[ 410s ] thds: 32 tps: 164.50 qps: 3284.19 (r/w/o: 2298.30/656.90/329.00) lat (ms,95%): 272.27 err/s: 0.00 reconn/s: 0.00
[ 420s ] thds: 32 tps: 183.20 qps: 3667.11 (r/w/o: 2566.80/733.90/366.40) lat (ms,95%): 248.83 err/s: 0.00 reconn/s: 0.00
[ 430s ] thds: 32 tps: 166.60 qps: 3333.69 (r/w/o: 2335.19/665.30/333.20) lat (ms,95%): 257.95 err/s: 0.00 reconn/s: 0.00
[ 440s ] thds: 32 tps: 177.40 qps: 3550.09 (r/w/o: 2484.59/710.70/354.80) lat (ms,95%): 257.95 err/s: 0.00 reconn/s: 0.00
[ 450s ] thds: 32 tps: 166.00 qps: 3317.81 (r/w/o: 2321.80/664.00/332.00) lat (ms,95%): 277.21 err/s: 0.00 reconn/s: 0.00
[ 460s ] thds: 32 tps: 161.40 qps: 3229.71 (r/w/o: 2262.01/644.90/322.80) lat (ms,95%): 267.41 err/s: 0.00 reconn/s: 0.00
[ 470s ] thds: 32 tps: 174.90 qps: 3496.47 (r/w/o: 2446.58/700.09/349.80) lat (ms,95%): 257.95 err/s: 0.00 reconn/s: 0.00
[ 480s ] thds: 32 tps: 162.40 qps: 3247.83 (r/w/o: 2273.82/649.21/324.80) lat (ms,95%): 277.21 err/s: 0.00 reconn/s: 0.00
[ 490s ] thds: 32 tps: 166.80 qps: 3332.05 (r/w/o: 2331.36/667.09/333.59) lat (ms,95%): 277.21 err/s: 0.00 reconn/s: 0.00
[ 500s ] thds: 32 tps: 156.40 qps: 3136.44 (r/w/o: 2196.93/626.71/312.80) lat (ms,95%): 277.21 err/s: 0.00 reconn/s: 0.00
[ 510s ] thds: 32 tps: 166.60 qps: 3328.51 (r/w/o: 2329.71/665.60/333.20) lat (ms,95%): 272.27 err/s: 0.00 reconn/s: 0.00
[ 520s ] thds: 32 tps: 156.90 qps: 3139.71 (r/w/o: 2198.30/627.60/313.80) lat (ms,95%): 277.21 err/s: 0.00 reconn/s: 0.00
[ 530s ] thds: 32 tps: 163.90 qps: 3274.19 (r/w/o: 2290.30/656.10/327.80) lat (ms,95%): 277.21 err/s: 0.00 reconn/s: 0.00
[ 540s ] thds: 32 tps: 156.40 qps: 3129.35 (r/w/o: 2190.36/626.19/312.79) lat (ms,95%): 287.38 err/s: 0.00 reconn/s: 0.00
[ 550s ] thds: 32 tps: 161.89 qps: 3234.90 (r/w/o: 2265.03/646.08/323.79) lat (ms,95%): 282.25 err/s: 0.00 reconn/s: 0.00
[ 560s ] thds: 32 tps: 150.81 qps: 3020.24 (r/w/o: 2114.50/604.13/301.61) lat (ms,95%): 287.38 err/s: 0.00 reconn/s: 0.00
[ 570s ] thds: 32 tps: 151.90 qps: 3035.50 (r/w/o: 2125.30/606.40/303.80) lat (ms,95%): 287.38 err/s: 0.00 reconn/s: 0.00
[ 580s ] thds: 32 tps: 156.50 qps: 3130.50 (r/w/o: 2190.30/627.20/313.00) lat (ms,95%): 287.38 err/s: 0.00 reconn/s: 0.00
[ 590s ] thds: 32 tps: 138.70 qps: 2775.40 (r/w/o: 1944.10/553.90/277.40) lat (ms,95%): 320.17 err/s: 0.00 reconn/s: 0.00
[ 600s ] thds: 32 tps: 149.90 qps: 2998.43 (r/w/o: 2098.05/600.49/299.89) lat (ms,95%): 308.84 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            1882118
        write:                           537732
        other:                           268880
        total:                           2688730
    transactions:                        134432 (224.00 per sec.)
    queries:                             2688730 (4480.18 per sec.)
    ignored errors:                      5      (0.01 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          600.1377s
    total number of events:              134432

Latency (ms):
         min:                                 19.62
         avg:                                142.84
         max:                               1386.07
         95th percentile:                    244.38
         sum:                            19202044.08

Threads fairness:
    events (avg/stddev):           4201.0000/14.96
    execution time (avg/stddev):   600.0639/0.04

[3/3] Cleaning up...
sysbench /usr/share/sysbench/oltp_read_write.lua --db-driver=pgsql --pgsql-host=172.17.0.2 --pgsql-port=5432 --pgsql-user=sbtest --pgsql-password=Opengauss@2022 --pgsql-db=sbtest --tables=20 --table-size=500000 cleanup
sysbench 1.0.11 (using system LuaJIT 2.1.0-beta3)

Dropping table 'sbtest1'...
Dropping table 'sbtest2'...
Dropping table 'sbtest3'...
Dropping table 'sbtest4'...
Dropping table 'sbtest5'...
Dropping table 'sbtest6'...
Dropping table 'sbtest7'...
Dropping table 'sbtest8'...
Dropping table 'sbtest9'...
Dropping table 'sbtest10'...
Dropping table 'sbtest11'...
Dropping table 'sbtest12'...
Dropping table 'sbtest13'...
Dropping table 'sbtest14'...
Dropping table 'sbtest15'...
Dropping table 'sbtest16'...
Dropping table 'sbtest17'...
Dropping table 'sbtest18'...
Dropping table 'sbtest19'...
Dropping table 'sbtest20'...
========================================
Sysbench full test completed. Results saved to sysbench_test_20241219_203446.log